var markers = [];
var iw = [];
var polygons = [];

//Границы культурного слоя
var cultureCoords = [
  {lat:57.992726, lng:31.352630},
  {lat:57.992242, lng:31.353660},
  {lat:57.992909, lng:31.364122},
  {lat:57.987865, lng:31.365396},
  {lat:57.985776, lng:31.365833},
  {lat:57.984412, lng:31.365892},
  {lat:57.983358, lng:31.366500},
  {lat:57.983067, lng:31.365122},
  {lat:57.982958, lng:31.363875},
  {lat:57.982774, lng:31.361362},
  {lat:57.982822, lng:31.359687},
  {lat:57.982579, lng:31.358613},
  {lat:57.982579, lng:31.357598},
  {lat:57.982443, lng:31.355473},
  {lat:57.983076, lng:31.354963},
  {lat:57.984027, lng:31.354814},
  {lat:57.984744, lng:31.354640},
  {lat:57.985326, lng:31.354469},
  {lat:57.986033, lng:31.354244},
  {lat:57.987463, lng:31.354470},
  {lat:57.987822, lng:31.354509},
  {lat:57.988376, lng:31.354137},
  {lat:57.988923, lng:31.353122},
  {lat:57.989808, lng:31.352604},
  {lat:57.990864, lng:31.352266},
  {lat:57.991995, lng:31.352180}
];

//Границы древнего городища
var townCoords = [
  {lat:57.992726739, lng:31.352630458},
  {lat:57.992242033, lng:31.353660267},
  {lat:57.992909197, lng:31.364122909},
  {lat:57.987865100, lng:31.365396123},
  {lat:57.985776785, lng:31.365833122},
  {lat:57.984412466, lng:31.365892521},
  {lat:57.983358256, lng:31.366500109},
  {lat:57.983067799, lng:31.365122984},
  {lat:57.982958052, lng:31.363875477},
  {lat:57.982774280, lng:31.361362464},
  {lat:57.982822346, lng:31.359687429},
  {lat:57.982579390, lng:31.358613165},
  {lat:57.982579395, lng:31.357598910},
  {lat:57.982443830, lng:31.355473234},
  {lat:57.981358855, lng:31.356656787},
  {lat:57.980303941, lng:31.357180101},
  {lat:57.979299744, lng:31.357346835},
  {lat:57.979605984, lng:31.359483889},
  {lat:57.979822002, lng:31.360558913},
  {lat:57.979908278, lng:31.362195803},
  {lat:57.980015850, lng:31.362175540},
  {lat:57.980163550, lng:31.364672584},
  {lat:57.980201092, lng:31.364857348},
  {lat:57.980232629, lng:31.365380363},
  {lat:57.980358006, lng:31.365342650},
  {lat:57.980397775, lng:31.365780895},
  {lat:57.980621155, lng:31.365655615},
  {lat:57.980631914, lng:31.365858119},
  {lat:57.980690377, lng:31.366380303},
  {lat:57.980816348, lng:31.366410188},
  {lat:57.980999297, lng:31.366793274},
  {lat:57.981374392, lng:31.366561855},
  {lat:57.982045710, lng:31.368366592},
  {lat:57.982676409, lng:31.370662879},
  {lat:57.984784569, lng:31.373522112},
  {lat:57.985202199, lng:31.373018935},
  {lat:57.985793802, lng:31.373930442},
  {lat:57.986609820, lng:31.376897590},
  {lat:57.986926360, lng:31.377158327},
  {lat:57.988663298, lng:31.376580649},
  {lat:57.988140548, lng:31.369157768},
  {lat:57.993197245, lng:31.367977241},
  {lat:57.993154039, lng:31.365417279},
  {lat:57.994085688, lng:31.365168415},
  {lat:57.993983430, lng:31.363751195},
  {lat:57.994161625, lng:31.363593446},
  {lat:57.994912139, lng:31.362149569},
  {lat:57.996857767, lng:31.358774190},
  {lat:57.996098491, lng:31.357191489},
  {lat:57.994422200, lng:31.354470910},
  {lat:57.994013146, lng:31.353908856},
  {lat:57.992726739, lng:31.352630458}
];

//координаты угловых точек мощности культурного слоя
var imageBounds = {
  north: 58.001649,
  south: 57.977164,
  east: 31.378151,
  west: 31.334498
};

//данные по раскопам
var pitsdata = {
  pits: [ 
    { lt: 57.987660, ln: 31.366009, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп I (1966-1967)</h2><div id="bodyContent"><p><b>S</b> = 300кв.м. совместно с Раскопом II <p><b>Мощность культурного слоя</b> = 2.6-2.9 м <p><b>Результаты</b> - Обнаружены останки жилых и хозяйственных сооружений. Вскрыто несколько ярусов регулярно мостившейся улицы, шедшей в напралении с юго-востока на северо-запад (предположительно, Богородицкая улица). Найдена первая в Старой Руссе берестяная грамота. <p><b>Датировки древнейших напластований</b> - 2-я половина XII в. </div> </div>'},
    { lt: 57.987392, ln: 31.365946, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп II (1967)</h2><div id="bodyContent"><p><b>S</b> = 300кв.м. совместно с Раскопом I <p><b>Мощность культурного слоя</b> = 2.6-2.9 м <p><b>Результаты</b> - Обнаружены останки жилых и хозяйственных сооружений. Вскрыто несколько ярусов регулярно мостившейся улицы, шедшей в напралении с юго-востока на северо-запад (предположительно, Богородицкая улица). Найдена первая в Старой Руссе берестяная грамота. <p><b>Датировки древнейших напластований</b> - 2-я половина XII в. </div></div>'},
    { lt: 57.984118, ln: 31.361318, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп III (1967)</h2><div id="bodyContent"><p><b>S</b> = 16кв.м. <p><b>Мощность культурного слоя</b> = 4-4.3 м <p><b>Результаты</b> - Обнаружены останки жилых и хозяйственных сооружений. <p><b>Датировки древнейших напластований</b> - XII в. </div></div>'},
    { lt: 57.984826, ln: 31.361257, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп IV (1967)</h2><div id="bodyContent"><p><b>S</b> = 16кв.м. <p><b>Мощность культурного слоя</b> = 3.1-3.3 м <p><b>Результаты</b> - Обнаружены останки жилых и хозяйственных сооружений. <p><b>Датировки древнейших напластований</b> - конец XI - 1-я половина XII в. </div></div>'},
    { lt: 57.988211, ln: 31.353045, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп V (1967)</h2><div id="bodyContent"><p><b>S</b> = 24кв.м. <p><b>Мощность культурного слоя</b> = 1.4-1.7 м <p><b>Результаты</b> - Обнаружены останки жилых и хозяйственных сооружений. <p><b>Датировки древнейших напластований</b> - XIV-XV вв. </div></div>'},
    { lt: 57.981686, ln: 31.358040, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп VI (1967)</h2><div id="bodyContent"><p><b>S</b> = 16кв.м. <p><b>Мощность культурного слоя</b> = 1.5-1.6 м <p><b>Результаты</b> - Обнаружены останки жилых и хозяйственных сооружений. <p><b>Датировки древнейших напластований</b> - XIV в. </div></div>'},
    { lt: 57.984930, ln: 31.363780, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп VII (1967-1968)</h2><div id="bodyContent"><p><b>S</b> = 64кв.м. <p><b>Мощность культурного слоя</b> = 4.1-4.2 м <p><b>Результаты</b> - Обнаружены останки жилых и хозяйственных сооружений. <p><b>Датировки древнейших напластований</b> - рубеж X-XI в. </div></div>'},
    { lt: 57.984778, ln: 31.360533, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп VIII (1968)</h2><div id="bodyContent"><p><b>S</b> = 100кв.м. <p><b>Мощность культурного слоя</b> = 3 м <p><b>Результаты</b> - Обнаружены останки жилых и хозяйственных сооружений. <p><b>Датировки древнейших напластований</b> - 1-я половина XII в. </div></div>'},
    { lt: 57.984566, ln: 31.363397, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп IX (1969)</h2><div id="bodyContent"><p><b>S</b> = 72кв.м. <p><b>Мощность культурного слоя</b> = 4,1-4,2 м <p><b>Результаты</b> - Обнаружены останки жилых и хозяйственных сооружений. <p><b>Датировки древнейших напластований</b> - рубеж X–XI в. </div></div>'},
    { lt: 57.984926, ln: 31.365532, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп X (1969-1970)</h2><div id="bodyContent"><p><b>S</b> = 64кв.м. <p><b>Мощность культурного слоя</b> = 6,2 м <p><b>Результаты</b> - Вскрыт перекресток двух улиц. Одна из них ориентирована в направлении ЗВ, вторая – СЮ (предположительно Борисоглебская и Губка). Обнаружена солеваренная печь, остатки жилых построек. <p><b>Датировки древнейших напластований</b> - рубеж X–XI в. </div></div>'},
    { lt: 57.984272, ln: 31.364647, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп XI (1970-1971)</h2><div id="bodyContent"><p><b>S</b> = 248кв.м. <p><b>Мощность культурного слоя</b> = 3,8-4 м <p><b>Результаты</b> - Дом-пятистенок, остатки жилых и хозяйственных сооружений. <p><b>Датировки древнейших напластований</b> - XI в. </div></div>'},
    { lt: 57.986052, ln: 31.365597, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп XII (1971-1974)</h2><div id="bodyContent"><p><b>S</b> = 144кв.м. <p><b>Мощность культурного слоя</b> = 5,5 м <p><b>Результаты</b> - Обнаружены остатки 8 домов-пятистенок площадью от 40 до 70 м², солеваренная печь.<p><b>Датировки древнейших напластований</b> - 1-я пол. XI в. </div></div>'},
    { lt: 57.984343, ln: 31.365312, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп XIII (1972)</h2><div id="bodyContent"><p><b>S</b> = 200кв.м. <p><b>Мощность культурного слоя</b> = 3,8-4 м <p><b>Результаты</b> - Обнаружено 13 ярусов мостовой улицы, идущей в направлении СЗ – ЮВ. Фрагменты усадьбы, жилые дома с карнизами, полом. <p><b>Датировки древнейших напластований</b> - XI в. </div></div>'},
    { lt: 57.983905, ln: 31.365075, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп XIV (1976-1977)</h2><div id="bodyContent"><p><b>S</b> = 224кв.м. <p><b>Мощность культурного слоя</b> = 3,8-4 м <p><b>Результаты</b> - Фрагменты усадьбы, межусадебный частокол. <p><b>Датировки древнейших напластований</b> - XI в. </div></div>'},
    { lt: 57.986025, ln: 31.365379, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп XV (1978-1988)</h2><div id="bodyContent"><p><b>S</b> = 100кв.м. <p><b>Мощность культурного слоя</b> = 5,5 м <p><b>Результаты</b> - Фрагменты усадьбы. <p><b>Датировки древнейших напластований</b> - рубеж X–XI в. </div></div>'},
    { lt: 57.985927, ln: 31.365544, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп XVI (Борисоглебский) (1988-2001)</h2><div id="bodyContent"><p><b>S</b> = 255кв.м. <p><b>Мощность культурного слоя</b> = 5,5 м <p><b>Результаты</b> - Вскрыта мостовая улицы (предположительно, Борисоглебской). Обнаружены фрагменты усадьбы, въезд в усадьбу, межусадебные частоколы, внутриусадебная вымостка. <p><b>Датировки древнейших напластований</b> - рубеж X–XI в. </div></div>'},
    { lt: 57.985254, ln: 31.360096, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп XVII (1990)</h2><div id="bodyContent"><p><b>S</b> = 48кв.м. <p><b>Мощность культурного слоя</b> = 1,5 м <p><b>Результаты</b> - Культурный слой в значительной степени переотложен. <p><b>Датировки древнейших напластований</b> - рубеж XII в. </div></div>'},
    { lt: 57.984955, ln: 31.357561, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп Георгиевский I (2002)</h2><div id="bodyContent"><p><b>S</b> = 165кв.м. <p><b>Мощность культурного слоя</b> = 3м. <p><b>Результаты</b> - фрагменты 2-х усадеб. <p><b>Датировки древнейших напластований</b> - 2-я четверть XII в. </div></div>'},
    { lt: 57.986312, ln: 31.365219, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп Пятницкий (2002 - по н.в.)</h2><div id="bodyContent"><p><b>S</b> = 200кв.м. <p><b>Мощность культурного слоя</b> = - <p><b>Результаты</b> - Исследованы фрагменты двух усадеб, межусадебный частокол, вымостка. <p><b>Датировки древнейших напластований</b> - 2-я пол. XIII в. </div></div>'},
    { lt: 57.983978, ln: 31.358031, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп Георгиевский II (2006)</h2><div id="bodyContent"><p><b>S</b> = 210кв.м. <p><b>Мощность культурного слоя</b> = 3,4м. <p><b>Результаты</b> - Исследован некрополь. Вскрыты остатки 3-х ярусов мостовой, обнаружена граница между усадебной застройкой и кладбищем. <p><b>Датировки древнейших напластований</b> - XII в. </div></div>'},
    { lt: 57.985201, ln: 31.362899, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп Петропавловский (2007)</h2><div id="bodyContent"><p><b>S</b> = 144кв.м. <p><b>Мощность культурного слоя</b> = до 2,5м. Работы не завершены. <p><b>Результаты</b> - Обнаружены остатки двух срубов, развал печи, межусадебный частокол. <p><b>Датировки древнейших напластований</b> - XV в. </div></div>'},
    { lt: 57.982010, ln: 31.358192, cont: '<div id="content"><div id="siteNotice"></div><h2 id="firstHeading" class="firstHeading">Раскоп Мининский I (2007)</h2><div id="bodyContent"><p><b>S</b> = 144кв.м. <p><b>Мощность культурного слоя</b> = до 2,5м. Работы не завершены. <p><b>Результаты</b> - Обнаружены остатки двух срубов, развал печи, межусадебный частокол. <p><b>Датировки древнейших напластований</b> - XV в.</div></div>'}
  ]
};